tutorials/incompressible/simpleFoam/motorBike/0/turbulentBoundaryField
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

boundaryField
{
    #include "fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    lowerWall
    {
        type            kqRWallFunction;
    }

    "motorBike_.*"
    {
        type            kqRWallFunction;
    }

    #include "frontBackUpperPatches"
}

// ************************************************************************* //
